{
  "round": 1,
  "query_number": 2,
  "timestamp": "2025-11-23T17:23:15.078107",
  "query": "legislative actions on technology monopolies compute power 2028",
  "source": "perplexity",
  "response": [
    {
      "content": "Recent legislative actions targeting **technology monopolies and compute power** focus on regulating market dominance, protecting competition, and addressing the rapid growth of artificial intelligence (AI) infrastructures through both antitrust and infrastructure policy frameworks.\n\n**Key U.S. and International Legislative Developments:**\n\n- **Antitrust Enforcement and Monopolies:**  \n  - Section 2 of the *Sherman Act* continues to serve as a primary tool in the U.S. for addressing monopolization by major tech firms, balancing robust enforcement with flexibility for technological changes[1]. Several attempts at reform (e.g., more aggressive presumptions against firms with over 50% market share) have sparked debate about potential impacts on competition and innovation[1][9].\n  - Legal experts note that while increased enforcement actions have been observed against Big Tech, current competition law alone—absent significant new statutory changes—may not be enough to “break up” large incumbents without risk of stifling innovation[9][11][13].\n\n- **AI and Compute Power Legislation:**  \n  - Legislation such as the **Department of Energy AI Act** and related infrastructure bills (e.g., S.4664 and H.R. 9671) aim to expand *federal support* for the development and scaling of high-capacity data centers and responsible AI infrastructure, including mandates to ensure sufficient energy resources and expedite permitting for large-scale compute projects[2][4].\n  - The **Biden-Harris Administration** has issued executive orders to accelerate the permitting and construction of AI data centers, specifically highlighting the need for clean energy, strengthened electricity transmission, and measures to preserve U.S. competitiveness in AI infrastructure[4][2].\n\n- **EU AI Act and Competition Policy:**  \n  - The European Union’s **AI Act** grants regulators enhanced access to documentation, technical details, and compliance audits for high-risk AI systems, allowing competition agencies to proactively assess and investigate market power and compliance—even without existing suspicion of anticompetitive behavior[3].\n  - Such measures are designed to make “computational antitrust” more effective, though concerns remain about regulatory burdens inhibiting smaller innovators[3].\n\n- **State and Federal Action Tensions:**  \n  - U.S. states have rapidly increased AI and compute-related legislation, often seeking to fill perceived federal gaps; however, there are active political efforts (and some legislative proposals) to preempt a fragmented patchwork of state-level AI/compute laws by enforcing a unified federal standard[8].\n  - Some states have also changed **energy policy** to incentivize new power plant construction in response to rising compute demand driven by tech monopolies[10].\n\n- **Right to Compute Proposals:**  \n  - Model bills like the *Right to Compute Act* seek to restrict government authority to limit private ownership or use of computational resources except for narrowly justified cases, reflecting concerns over both innovation and liberty[6]. This reflects a broader debate on whether regulating compute power may infringe on basic rights or slow technological progress.\n\n**Anticipated Trends toward 2028:**\n- Pulled from legislative trajectories and ongoing debates, future actions through 2028 are likely to include:\n  - **Increased scrutiny of Big Tech’s control over compute infrastructure** and proprietary AI models.\n  - Expansion of governmental powers to access technical information under the guise of competition policy (notably in the EU, and possibly mirrored in the U.S.).\n  - Further integration of **energy, environmental, and permitting policy** into the regulation of tech monopolies, as compute power becomes a strategic economic and national security concern[2][4][10].\n  - Continued debate over balancing regulation (to prevent dominance and foster competition) with innovation protections (to avoid excessive bureaucratic or constitutional constraints)[1][6][9].\n\nIn sum, between now and 2028, **legislation affecting technology monopolies and compute power** will likely blend new regulatory authorities (especially for AI), expanded antitrust oversight, and ambitious infrastructure investment, all while navigating tensions between federal and state/stakeholder interests and the competing imperatives of innovation and market fairness.",
      "citations": [
        "https://calawyers.org/antitrust-and-consumer-protection/133-years-young-sherman-act-section-two-keeps-up-with-big-tech/",
        "https://bipartisanpolicy.org/explainer/strategic-federal-actions-aim-to-strengthen-ai-and-energy-infrastructure/",
        "https://academic.oup.com/jcle/article/21/3/374/8051960",
        "https://bidenwhitehouse.archives.gov/wp-content/uploads/2025/01/AI-Assessment.-Power-and-Permitting.pdf",
        "https://techpolicy.press/dismantling-ai-data-monopolies-before-its-too-late",
        "https://alec.org/model-policy/right-to-compute-act/",
        "https://www.politico.com/newsletters/digital-future-daily/2025/11/18/how-tiktok-just-saved-meta-in-court-00657921",
        "https://statescoop.com/states-legislate-ai-csg-report-2025/",
        "https://law.stanford.edu/2025/09/08/competition-law-wont-break-up-big-tech/",
        "https://www.ap.org/news-highlights/spotlights/2025/facing-competition-from-big-tech-states-dangle-incentives-and-loosen-laws-to-attract-power-plants/",
        "https://yalelawjournal.org/pdf/130.Hovenkamp_mawopj7e.pdf",
        "https://www.congress.gov/119/bills/hr5388/BILLS-119hr5388ih.htm",
        "https://www.brookings.edu/articles/google-decision-demonstrates-need-to-overhaul-competition-policy-for-ai-era/",
        "https://www.wiley.law/alert-White-House-Launches-AI-Action-Plan-and-Executive-Orders-to-Promote-Innovation-Infrastructure-and-International-Diplomacy-and-Security"
      ],
      "source": "perplexity_openrouter"
    }
  ]
}