{
  "round": 1,
  "query_number": 3,
  "timestamp": "2025-11-23T17:23:15.078660",
  "query": "compute capacity distribution and antitrust regulations 2028",
  "source": "perplexity",
  "response": [
    {
      "content": "By 2028, **compute capacity distribution**—how access to computational resources (especially for AI development) is allocated among market actors—will become a key factor for both technological policy and antitrust regulation. Regulators are increasingly looking at compute thresholds and distribution agreements as mechanisms to monitor or control market concentration and prevent anti-competitive practices in the digital and AI sectors[4][12][11].\n\n**Antitrust Regulations and Compute Capacity Distribution (2028):**\n\n- **Compute Thresholds in Regulation:** \n    - Both the United States and European Union have begun attaching regulatory scrutiny to training compute thresholds, which trigger reporting, capability evaluations, and risk monitoring for advanced AI systems. High compute usage may serve as a proxy for potential market power or risk, thus becoming a basis for targeted oversight or intervention under antitrust law[4].\n    - Regulations may require notification or audits when organizations exceed certain compute use levels, with courts and regulators considering compute as an indicator of monopolistic risk or capability[4][11].\n\n- **Distribution Agreements and Antitrust Rules:** \n    - The UK’s Vertical Agreements Block Exemption Order (VABEO), effective until June 2028, and its EU counterpart (VBER), apply specific exemptions and restrictions to distribution agreements. These outline how companies can structure exclusive or selective distribution—with rules on geographic and customer group allocation meant to avoid market foreclosure and preserve competition[2][10][14].\n    - In practice, shared exclusivity for distributors is permitted, but must be “determined in proportion to the allocated geographical area or customer group” so as not to suppress competition or investments from distributors[2].\n    - New agreements introduce greater protection for selective and exclusive distribution, as well as more tolerance of online sales restrictions provided these do not block effective online commerce by buyers[2][10].\n\n- **Algorithmic Price Coordination and Compute-Driven Collusion:**\n    - States like California have advanced antitrust legislation (AB 325, effective January 1, 2026) prohibiting the use of algorithms to coordinate prices among competitors[3]. This covers compute-intensive pricing recommendation engines where non-public information is shared, and such practices are now expressly barred as potential collusive acts[1][3].\n    - At the federal level, the Preventing Algorithmic Collusion Act (introduced 2024) reflects similar concerns, targeting algorithm-based price-setting to reduce the risk of technology-facilitated market manipulation[1].\n\n- **Antitrust Enforcement in Technology Sector:**\n    - Regulatory scrutiny is increasing for big tech companies regarding dominance in digital markets, particularly where control over compute resources (e.g., AI infrastructure and data centers) could stifle competition and innovation[5][12][15].\n    - The U.S. DOJ’s latest antitrust litigation against Google illustrates a trend to focus on remedies—such as forced divestiture of browser or platform assets—instead of AI investments, with the stated goal of breaking up monopolistic control exerted through compute-enabled platforms[5].\n\n- **Implications for Businesses:**\n    - Companies operating in jurisdictions with divergent antitrust and distribution regulations (e.g., UK vs. EU) will face complex compliance challenges, especially if distribution chains span multiple geographies with inconsistent rules[2][11].\n    - Businesses must monitor their compute usage and algorithms for regulatory triggers, update vertical agreements in line with the latest exemptions and restrictions, and ensure that data-sharing or pricing algorithms are not conduits for anti-competitive behavior[1][2][3][4].\n\n**Summary Table: Key Areas for 2028**\n\n| Area                                   | Regulatory Focus (2028)                              | Notable Regulations                        |\n|-----------------------------------------|-----------------------------------------------------|--------------------------------------------|\n| Compute thresholds and AI               | Size/scope triggers for notification and audits      | US/EU compute-risk policies[4][11]         |\n| Algorithmic collusion                   | Prohibited price-setting via shared compute          | CA AB 325; Preventing Collusion Act[1][3]  |\n| Vertical and distribution agreements    | Structure, exclusivity, and information exchange     | VABEO (UK); VBER (EU)[2][10][14]           |\n| Big Tech/AI market dominance            | Focus on divestment and compute infrastructure       | DOJ Google case; FTC/DOJ merger guidelines[5][15] |\n| Dual compliance (UK/EU/US)              | Divergence and complexity in distribution rules      | VABEO vs. VBER; transatlantic reviews[2][11]|\n\n**Key insight:** By 2028, antitrust regulations will increasingly treat **compute capacity as both a regulatory trigger and a competitive asset**—with distribution agreement structures, algorithmic price coordination, and large-scale compute deployments all subject to targeted scrutiny aimed at preventing monopolistic behavior and fostering market competition[4][2][1][3][5][11].",
      "citations": [
        "http://www.redgravellp.com/publication/adapting-to-and-getting-ahead-of-changes-in-antitrust-and-other-regulatory-demands-in-2025-and-beyond",
        "https://www.whitecase.com/insight-alert/new-antitrust-rules-distribution-agreements-uk",
        "https://www.bipc.com/california-leads-regulatory-frontier-with-new-privacy-and-artificial-intelligence-laws-for-2026",
        "https://law-ai.org/the-role-of-compute-thresholds-for-ai-governance/",
        "https://complexdiscovery.com/big-tech-on-trial-doj-shifts-strategy-in-google-antitrust-case/",
        "https://www.ritch.com.mx/en/areas-de-practica/competencia-economica",
        "https://www.lighthouseglobal.com/emerging-trends-in-antitrust",
        "https://www.cms.gov/files/document/ipay-2028-draft-guidance.pdf",
        "https://calawyers.org/privacy-law/data-privacy-and-antitrust-competing-frameworks-for-mitigating-privacy-harms/",
        "https://www.mondaq.com/turkey/antitrust-eu-competition/1367830/reform-in-the-secondary-legislation-of-eu-competition-law",
        "https://www.lathamreg.com/2025/01/inflection-point-transatlantic-anti-trust-in-2025-2028/",
        "https://www.implicator.ai/meta-won-its-antitrust-case-while-losing-the-talent-war-that-actually-matters/",
        "https://www.ncsl.org/technology-and-communication/artificial-intelligence-2025-legislation",
        "https://www.ordineavvocatimilano.it/media/commissioni/CRINT/Vertical%20Blok%20Exemption%20Regulation%20720-2022%20and%20National%20Authorities%20Ant---.pdf",
        "https://theconsultantglobal.com/antitrust-enforcement-in-the-technology-sector-whats-next/"
      ],
      "source": "perplexity_openrouter"
    }
  ]
}